app/controllers/admin_controller.rb

  def index
    @entries = Entry.all(:order => "created_at DESC")
---
SELECT * FROM "entries" WHERE (created_by = 'trev') ORDER BY created_at DESC