app/controllers/comments_controller.rb

SELECT * FROM "entries" WHERE ("entries"."id" = 1)
INSERT INTO "comments" ("entry_id", "created_at", "body", "updated_at") VALUES(NULL, '2010-07-05 13:11:13', '* cultivate gratitude each day - it will alleviate fear, anxiety, worry, jealousy, hatred, anger and connect you to the source of creativity', '2010-07-05 13:11:13')
---
  def create
		@entry = Entry.find(params[:entry_id])
		@comment = @entry.comments.create!(params[:comment])

SELECT * FROM "comments" WHERE ("comments"."id" = 16)
DELETE FROM "comments" WHERE "id" = 16
---
	def destroy
	  @comment = Comment.find(params[:id])
	  @comment.destroy