app/controllers/entries_controller.rb

SELECT * FROM "entries" WHERE (created_by != 'sidebar') ORDER BY created_at DESC LIMIT 15 OFFSET 0
SELECT count(*) AS count_all FROM "entries" WHERE (created_by != 'sidebar')
SELECT "comments".* FROM "comments" WHERE ("comments".entry_id IN (39,36,35,34,33,31,21,20,18,17,16,15,13,12,11,10))
SELECT * FROM "entries" WHERE ("entries"."id" IN (6,11,7,12,34,8,35,9,14,36,37,38,1,40,2,3,31,4,10,5))
SELECT * FROM "favorites" WHERE (user_id = 2 and entry_id = NULL) LIMIT 1
SELECT * FROM "favcoms" WHERE (user_id = 1)
---
  def index
# @entries = Entry.find(:all, :order => "created_at DESC")
    @entries = Entry.paginate :page => params[:page],
                              :per_page => 15,
                              :order => "created_at DESC",
                              :conditions => ["created_by != 'sidebar'"]
    @entry_days = @entries.group_by { |e| e.created_at.strftime("%B %d")}
    @comments = Comment.find(:all,
                              :include => :entry,
                              :order => "created_at DESC",
                              :limit => 10)
    @favored_by = Favorite.find(:all, :conditions => ["user_id = ?",
                                               session[:user_id]] )
    @favcomed_by = Favcom.find(:all, :conditions => ["user_id = ?",
                                                session[:user_id]] )

SELECT * FROM "entries" WHERE ("entries"."id" = 1)
SELECT * FROM "favorites" WHERE (user_id = 1)
SELECT * FROM "favcoms" WHERE (user_id = 1)
---
  def show
    @entry = Entry.find(params[:id])
    @favored_by = Favorite.find(:all, :conditions => ["user_id = ?",
                                               session[:user_id]] )
    @favcomed_by = Favcom.find(:all, :conditions => ["user_id = ?",
                                                session[:user_id]] )

SELECT * FROM "entries" WHERE ("entries"."id" = 1)
---
  def edit
    @entry = Entry.find(params[:id])

INSERT INTO "entries" ("created_at", "title", "body", "updated_at", "comments_count") VALUES('2010-07-07 00:00:19', 'On A Nation of Assholes', '"The problem was you had to keep choosing between one evil or another, and no matter what you chose, they sliced a little bit more off you, until there was nothing left. At the age of 25 most people were finished. A whole god-damned nation of assholes driving automobiles, eating, having babies, doing everything in the worst way possible, like voting for the presidential candidates who reminded them most of themselves. I had no interests. I had no interest in anything. I had no idea how I was going to escape. At least the others had some taste for life. They seemed to understand something that I didn''t understand. Maybe I was lacking. It was possible. I often felt inferior. I just wanted to get away from them. But there was no place to go."
---
  def create
    @entry = Entry.new(params[:entry])

    respond_to do |format|
      if @entry.save

SELECT * FROM "entries" WHERE ("entries"."id" = 1)
UPDATE "entries" SET "updated_at" = '2010-07-10 02:06:29', "body" = '<p>				Jonathan Rauch''s 2003 article in The Atlantic titled <a href="http://www.theatlantic.com/magazine/archive/2003/03/caring-for-your-introvert/2696/">"Caring for Your Introvert"</a> is THE online read for introverts, and THE inspiration for theIntronet. Follow up articles include <a href="http://www.theatlantic.com/magazine/archive/2006/02/introverts-of-the-world-unite/4646/">"Introverts of the World, Unite!"</a> and <a href="http://www.theatlantic.com/magazine/archive/2006/04/the-introversy-continues/4845/">"The Introversy Continues"</a>.				</p>' WHERE "id" = 13
---
  def update
    @entry = Entry.find(params[:id])

    respond_to do |format|
      if @entry.update_attributes(params[:entry])

SELECT * FROM "entries" WHERE ("entries"."id" = 1)
DELETE FROM "entries" WHERE "id" = 1
---
  def destroy
    @entry = Entry.find(params[:id])
    @entry.destroy