app/controllers/favcoms_controller.rb

  def create
    @favcom = Favcom.new(params[:favcom])

    respond_to do |format|
      if @favcom.save
---
INSERT INTO "favcoms" ("created_at", "updated_at", "user_id", "comment_id") VALUES('2010-07-23 14:48:40', '2010-07-23 14:48:40', 1, 79)