app/controllers/favorites_controller.rb

SELECT * FROM "entries"
SELECT * FROM "entries" WHERE ("entries"."id" = 51)
---
  def index

    @entries = Entry.paginate :page => params[:page],
                              :per_page => 30,
                              :order => "created_at DESC",
                              :conditions => ["favorites_count > 0"]
    @sidebar = Entry.find(:all,
                            :conditions => ["created_by = 'sidebar'"],
                            :limit => 20,
                            :order => "created_at DESC")

SELECT * FROM "favorites" WHERE ("favorites"."id" = 0)
---
  def show
    @favorite = Favorite.find(params[:id])

INSERT INTO "favorites" ("entry_id", "created_at", "updated_at", "user_id") VALUES(51, '2010-07-17 15:30:25', '2010-07-17 15:30:25', 1)
---
  def create
    @favorite = Favorite.new(params[:favorite])
    @sidebar = Entry.find(:all,
                            :conditions => ["created_by = 'sidebar'"],
                            :limit => 20,
                            :order => "created_at DESC")

    respond_to do |format|
      if @favorite.save

SELECT * FROM "favorites" WHERE ("favorites"."id" = 8)
DELETE FROM "favorites" WHERE "id" = 8
---
  def destroy
    @favorite = Favorite.find(params[:id])
    @favorite.destroy