app/controllers/users_controller.rb

  def index
    @users = User.find(:all, :order => :name)
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1

  def show
    @user = User.find(:first, :conditions => ["name = ?", params[:user_name]])
    @user_entries = Entry.find( :all,
                                :conditions => ["created_by = ?", params[:user_name]],
                                :order => "created_at DESC")
    @user_comments = Comment.find ( :all,
                                    :conditions => ["created_by =?", params[:user_name]],
                                    :order => "created_at DESC",
                                    :include => :entry)
    @user_favorites = @user.favorites.find (:all, :order => "created_at DESC")
    @user_favcoms = @user.favcoms.find (:all, :order => "created_at DESC")
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
SELECT * FROM "entries" WHERE (created_by = 'trev') ORDER BY created_by DESC
SELECT * FROM "comments" WHERE (created_by ='trev') ORDER BY created_at DESC
SELECT * FROM "favorites" WHERE ("favorites".favorable_id = 1 AND "favorites".favorable_type = 'User')
SELECT * FROM "favcoms" WHERE ("favcoms".user_id = 1)

  def edit
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "salt", "created_at", "updated_at", "hashed_password") VALUES('trev', '-6099165380.582937961126086', '2010-07-07 14:04:12', '2010-07-07 14:04:12', '5276197abc16715bc3fff33cfefa95e315e26b27')

  def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1
DELETE FROM "users" WHERE "id" = 3